<html>
<body>
<p><strong>FAIRE UN CROQUIS EN 3D</strong></p>
<p> L'esquisse 3D se fait autour d'une vis&eacute;e de cheminement &agrave; la 
  fois. L'affichage est donc centr&eacute; sur la vis&eacute;e s&eacute;lectionn&eacute;e. 
  <br>
  La fen&ecirc;tre d'esquisse 3D comporte trois modes (et trois barres de boutons 
  diff&eacute;rentes) : </p>
<ul>
  <li> d&eacute;placer</li>
  <li> dessiner</li>
  <li> s&eacute;lectionner (uniquement pour la vue &quot;cheminement&quot;) </li>
</ul>
<p>Comme pour la fen&ecirc;tre de dessin 2D, les boutons verts les plus &agrave; 
  gauche indiquent le mode actuel.<br>
  Les autres boutons du mode d&eacute;placement sont les suivants : </p>
<ul>
  <li>mode d'affichage</li>
  <li> notes</li>
  <li> parois</li>
  <li> rafra&icirc;chir</li>
</ul>
<p>En mode dessin, vous pouvez tracer des lignes de contour. Les lignes de contour 
  de la vue du &quot;cheminement&quot; se situent dans le plan 3D plongeant avec 
  ce cheminement. Celles des vues en coupe se situent dans le plan de coupe. </p>
<p> <strong>BOUTONS</strong> : </p>
<ul>
  <li> annuler</li>
  <li> r&eacute;tablir</li>
</ul>
<p>Le mode effacement dispose de boutons :</p>
<ul>
  <li>d&eacute;faire</li>
  <li> r&eacute;tablir</li>
  <li> taille de la gomme</li>
</ul>
<p> Pour le mode s&eacute;lection : </p>
<ul>
  <li> mode de s&eacute;lection : soit des points de contour/section, soit des 
    stations voisines</li>
  <li> taille de la s&eacute;lection</li>
  <li> effacer</li>
  <li> ouvrir : soit la section, soit la vue &quot;cheminement&quot; voisine</li>
  <li> effacer la s&eacute;lection</li>
</ul>
<p><br>
  La vue &quot;cheminement&quot; contient &eacute;galement les vis&eacute;es de 
  cheminement connect&eacute;es. Le fait d'appuyer sur l'une des stations voisines 
  permet de d&eacute;placer la vue de &quot;cheminement&quot; vers cette autre 
  station.</p>
<p> Une section peut &ecirc;tre cr&eacute;&eacute;e lorsque deux points sur deux 
  lignes de contour ont &eacute;t&eacute; s&eacute;lectionn&eacute;s. Le plan 
  de la section peut &ecirc;tre &quot;vertical&quot; ou &quot;horizontal&quot;. 
  S'il est vertical, il contient les deux points s&eacute;lectionn&eacute;s et 
  l'axe Y est la verticale. S'il est horizontal, il passe par leur point m&eacute;dian 
  et l'axe Y est l'azimut de la jambe. Les deux points (ou leurs projections) 
  sont affich&eacute;s &agrave; l'&eacute;cran.<br>
  Un menu permet de commuter entre les choix &quot;vertical&quot; et &quot;horizontal&quot;.Lorsque 
  le canevas affiche une section x, le bouton &quot;s&eacute;lectionner&quot; 
  se transforme en bouton &quot;retour&quot;. </p>
<p><br>
  Un appui court ferme la section transverse et ram&egrave;ne &agrave; la vue 
  de cheminement .Une section transverse peut &ecirc;tre rouverte en s&eacute;lectionnant 
  le point de la section transverse (&agrave; mi-chemin entre les deux points 
  de base de la section transverse) et en appuyant sur le bouton &quot;ouvrir&quot;. 
</p>
<p><strong>MENUS</strong></p>
<ul>
  <li>Fermer</li>
  <li> Exporter (c'est-&agrave;-dire sauvegarder)</li>
  <li> Ajustement du zoom </li>
  <li>Type de section</li>
  <li> Supprimer</li>
  <li> Param&egrave;tres</li>
  <li> Aide </li>
</ul>
</body>
</html>
