<html>
<body>
<h4>GESTIONNAIRE DE PROJET TOPOGRAPHIQUE - Fen&ecirc;tre de gestion de projet 
</h4>
<p>La <em>fen&ecirc;tre de gestion de projet</em> s'ouvre en appuyant sur un des 
  noms de projets de la liste de la <a href="page_tdm_config.htm">fen&ecirc;tre 
  des projets</a>. </p>
<p>Cette fen&ecirc;tre liste les diff&eacute;rents relev&eacute;s faisant partie 
  d'un m&ecirc;me projet tpographique. La liste est vide si le projet ne contient 
  pas de relev&eacute; topographique. Chaque topographie est s&eacute;lectionnable 
  en vue de diverses actions en appuyant sur sa case &agrave; cocher.<br>
</p>
<p> <b>Menus</b> 
<ul>
  <li><em>Fermer</em> la fen&ecirc;tre</li>
  <li><em>Exporter</em> le projet (Therion ou Survex)</li>
  <li><em>Supprimer</em> le projet</li>
  <li><em>Aide</em></li>
</ul>
<br>
<b>Boutons</b> 
<ul>
  <li><em><img src="btn_thman_ajouter.png"></em> <em>ins&eacute;rer</em> des relev&eacute;s 
  </li>
  <li><em><img src="btn_thman_supprimer.png"> supprimer</em> les relev&eacute;s 
    s&eacute;lectionn&eacute;s</li>
  <li> <em><img src="btn_thman_topo.png"> affichage</em> 2D des relev&eacute;s 
    s&eacute;lectionn&eacute;s, en plan </li>
  <li><img src="btn_thman_geopoints.png"> <em>relev&eacute;s g&eacute;or&eacute;f&eacute;renc&eacute;s</em></li>
  <li><img src="btn_thman_equates.png"> liste des <em>&eacute;quivalences</em> 
    du projet </li>
  <li><em><img src="btn_3d.png">&nbsp;vue 3D</em> du projet </li>
</ul>
<p align="left"> Le bouton d'insertion affiche la liste des relev&eacute;s dans 
  la base de donn&eacute;es TopoDroid. Les relev&eacute;s sont ajout&eacute;s 
  au projet en cochant leurs cases et en confirmant avec le bouton <em>OK</em>.<br>
</p>
<p> <strong>Vue 3D du projet</strong><br>
  Le projet est affich&eacute; dans le visualiseur 3D en commen&ccedil;ant par 
  le premier relev&eacute;.<br>
  Les relev&eacute;s suivants sont affich&eacute;s en 3D uniquement s'ils sont 
  (directement ou indirectement) connect&eacute;s au premier relev&eacute;. 
<p><br>
  Si plusieurs relev&eacute;s sont g&eacute;or&eacute;f&eacute;renc&eacute;s, 
  ils peuvent tous &ecirc;tre affich&eacute;s en 3D, ainsi que les relev&eacute;s 
  connect&eacute;s.</p>
<p><br>
  <strong>Vue 2D des relev&eacute;s</strong><br>
  Les relev&eacute;s s&eacute;lectionn&eacute;s sont affich&eacute;s en plan, 
  avec la ligne m&eacute;diane et les noms des stations. Chaque relev&eacute; 
  a une couleur diff&eacute;rente. Au bout d'un certain temps, les couleurs se 
  r&eacute;p&egrave;tent, vous ne devez donc afficher que deux ou trois relev&eacute;s 
  &agrave; la fois.<br>
  Les &eacute;quivalences sont repr&eacute;sent&eacute;es par des lignes rouges 
  en pointill&eacute;s, et les stations &eacute;quivalentes ont un fond rond.</p>
<p><br>
  La vue peut &ecirc;tre d&eacute;plac&eacute;e et zoom&eacute;e.<br>
  Un relev&eacute; peut &ecirc;tre saisi (tapez sur une station : elle est entour&eacute;e) 
  et d&eacute;plac&eacute; tandis que les autres relev&eacute;s ne bougent pas. 
  De cette fa&ccedil;on, vous pouvez superposer les stations de diff&eacute;rents 
  sondages que vous voulez mettre en &eacute;quation. Lorsqu'elles se chevauchent, 
  entourez-les toutes les deux en tapant sur le point : vous pouvez alors ins&eacute;rer 
  l'&eacute;quation entre elles avec le menu &quot;ajouter une &eacute;quation&quot;.</p>
<p><br>
  <strong>Boutons</strong> </p>
<ul>
  <li><img src="btn_thman_equates2.png" width="42" height="42">&nbsp;<em>Ajouter</em> 
    une nouvelle &eacute;quivalence : ouvre un dialogue pour ajouter manuellement 
    une &eacute;quivalence entre les relev&eacute;s du projet de la cavit&eacute;.</li>
  <li><img src="btn_thman_equates.png"> <em>Lister l</em>es &eacute;quivalences 
    entre les relev&eacute;s du projet de la cavit&eacute;.</li>
</ul>
<p>&nbsp;<p> 

</body>
</html>