	<html>
	<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=utf-8" />
</HEAD>
	<body>
<h4> TÉLÉCHARGEMENT DES DONNÉES DU DISTOX</h4>
<p align="justify">Le bouton <u>T&eacute;l&eacute;charger</u> <img src="btn_download.png" width="36" height="36"> 
  d&eacute;marre une connexion avec le DistoX pour t&eacute;l&eacute;charger les 
  donn&eacute;es. Tant que la connexion est active, il reste rouge. Si vous utilisez 
  le mode de t&eacute;l&eacute;chargement &laquo;&agrave; la demande&raquo;, la 
  connexion est ferm&eacute;e lorsqu'il n'y a plus de donn&eacute;es &agrave; 
  r&eacute;cup&eacute;rer. Avec le mode de t&eacute;l&eacute;chargement &quot;continu&quot;, 
  la connexion reste ouverte (et les donn&eacute;es sont t&eacute;l&eacute;charg&eacute;es 
  en continu d&egrave;s que les mesures sont prises) jusqu'&agrave; ce que le 
  DistoX et l'Android perdent la connexion Bluetooth. Le mode qui vous convient 
  le mieux d&eacute;pend de vos habitudes. Avec le mode &quot;&agrave; la demande&quot;, 
  vous pouvez vous concentrer sur l'esquisse et d'autres t&acirc;ches sans &ecirc;tre 
  g&ecirc;n&eacute; par les donn&eacute;es entrantes, et lorsque vous t&eacute;l&eacute;chargez 
  les donn&eacute;es, vous pouvez vous concentrer sur elles (elles sont surlign&eacute;es 
  en bleu). D'autre part, le t&eacute;l&eacute;chargement &quot;&agrave; la demande&quot; 
  n&eacute;cessite des pauses pour obtenir les donn&eacute;es, et celles-ci sont 
  particuli&egrave;rement longues si vous avez pris plusieurs vis&eacute;es entre 
  les deux.</p>
<p align="justify"> Si la connexion Bluetooth avec le DistoX est interrompue (par 
  exemple si le DistoX s'&eacute;loigne trop de l'Android ou s'il est &eacute;teint), 
  le t&eacute;l&eacute;chargement des donn&eacute;es est interrompu. En mode &quot;continu&quot;, 
  si le param&egrave;tre &quot;Reconnexion automatique&quot; est s&eacute;lectionn&eacute;, 
  <em>TopoDroid</em> essaie de se connecter au DistoX toutes les quelques secondes.</p>
<p align="justify">Lorsque la <a href="manual06.htm"><u></u></a><u><a href="manual06.htm"><em>Fenêtre 
  des visées du relevé topo</em></a></u>est fermée, la connexion de t&eacute;l&eacute;chargement 
  des donn&eacute;es est interrompue. La connexion de t&eacute;l&eacute;chargement 
  n'est pas interrompue lorsque l'activit&eacute; est en pause (l'affichage s'&eacute;teint). 
  Si vous ouvrez une esquisse alors que la connexion de t&eacute;l&eacute;chargement 
  est active en mode &quot;continu&quot;, la connexion est conserv&eacute;e et 
  les donn&eacute;es sont t&eacute;l&eacute;charg&eacute;es (et affich&eacute;es 
  dans l'esquisse au fur et &agrave; mesure).</p>
<p align="justify"> Pour le SAP5 et le BRIC4, les données sont toujours téléchargées 
  en mode continu.</p>
<p><strong>DistoXBLE</strong></p>
<p> Le téléchargement des données du DistoXBLE peut échouer la première fois immédiatement 
  après que le Bluetooth Android a été activé (c'est-à-dire mis en marche). Dans 
  ce cas, éteignez et rallumez le DistoXBLE et essayez à nouveau de télécharger 
  les données.</p>
<p><strong>BRIC4</strong></p>
<p> Le téléchargement des données du BRIC4 peut être limité aux valeurs essentielles 
  (distance, azimut, pente, et un peu plus), ou complet, avec toutes les informations 
  transférées par le protocole BRIC4. </p>
<p>Le protocole complet comprend l'&quot;index&quot; de la visée. <em>TopoDroid</em> 
  utilise l'index du BRIC4 comme index des données dans la table de la base de 
  données, s'il le reçoit, et si le mode de données BRIC est configuré pour utiliser 
  également l'index. Comme l'index des données doit être unique, si <em>TopoDroid</em> 
  reçoit une visée avec un index qui est déjà dans la base de données, il utilise 
  une nouvelle valeur pour l'index des données au lieu de l'index du BRIC4.<br>
  L'index du BRIC4 peut être réinitialisé à l'aide de la commande <em>Effacer 
  Mémoire du BRIC4</em> du menu <em>Avancé</em>.<br>
  Il est possible de désactiver l'utilisation de l'index du BRIC4 [G], et de laisser 
  <em>TopoDroid</em> assigner des valeurs incrémentales à l'index des données. 
</p>
</body></html>