<html><body>
<h4><strong>VISIONNEUSE 3D -</strong> <strong></strong> MNE DE SURFACE</h4>
<p>Un mod&egrave;le num&eacute;rique d'&eacute;l&eacute;vation (MNE) de surface 
  peut &ecirc;tre ajout&eacute; aux mod&egrave;les <em>TopoDroid</em> ou peut 
  &ecirc;tre affich&eacute; s'il est inclus dans un fichier de mod&egrave;le charg&eacute; 
  (par exemple, dans un fichier lox).
<p> Le bouton <em>Surface</em>&nbsp;<img src="btn_3d_surface_on.png" width="36" height="36"> 
  de la fen&ecirc;tre du visualisateur 3D permet d'activer ou de d&eacute;sactiver 
  l'affichage du MNE.
<p> Cette bo&icirc;te de dialogue s'ouvre &agrave; partir du menu <em>Surface</em> 
  de la <em>Fen&ecirc;tre de la visionneuse 3D</em>.
<p> Elle est utilis&eacute;e pour charger un MNE, une texture de surface &agrave; 
  superposer sur le MNE et pour ajuster son opacit&eacute;.
<ul>
  <li> un bouton pour s&eacute;lectionner un fichier DEM</li>
  <li> un bouton pour s&eacute;lectionner un fichier de texture, apr&egrave;s 
    le chargement d'un MNE (ou si le mod&egrave;le poss&egrave;de d&eacute;j&agrave; 
    un MNE)</li>
  <li> un curseur pour r&eacute;gler l'opacit&eacute;</li>
  <li> une case &agrave; cocher pour activer l'affichage de la projection du mod&egrave;le 
    sur le MNE</li>
  <li> une case &agrave; cocher pour activer l'affichage de la texture de la surface 
    (s'il y en a une).</li>
</ul>
<p> <strong>Fichier MNE</strong><br>
  La visionneuse 3D prend en charge les fichiers MNE au format ASCII ou au format 
  de grille Therion (voir le manuel pour plus de d&eacute;tails sur les formats 
  de fichier et les syst&egrave;mes de r&eacute;f&eacute;rence de coordonn&eacute;es).</p>
<p> <strong>Fichier de texture</strong><br>
  La visionneuse 3D prend en charge les fichiers d'image GeoTIFF de texture et 
  les fichiers de carte OSM. </p>
<p>Les coordonn&eacute;es X-Y du MNE et de la texture doivent &ecirc;tre dans 
  le syst&egrave;me de r&eacute;f&eacute;rence de coordonn&eacute;es du mod&egrave;le 
  (qui peut &ecirc;tre modifi&eacute; dans la bo&icirc;te de dialogue de la station 
  g&eacute;olocalis&eacute;e), car la visionneuse 3D n'effectue pas de conversions 
  de coordonn&eacute;es. </p>
<p>Les fichiers OSM sont en coordonn&eacute;es g&eacute;ographiques WGS84. Les 
  valeurs peuvent &ecirc;tre utilis&eacute;es avec des mod&egrave;les en UTM cartographique, 
  mais la conversion est approximative.</p>
</body></html>
