<html><body>

<h4>PILE D'ANNULATION</h4>

<p>TopoDroid pilote les fonctions 'Annuler / Refaire' gr&acirc;ce &agrave; une 
  suite d'actions 'dessine / supprime / &eacute;dite' qui sont stock&eacute;es 
  empil&eacute;es. Lorsque vous dessinez quelque chose, une action de dessin est 
  plac&eacute;e sur le haut de la pile. Son annulation revient &agrave; d&eacute;placer 
  le pointeur de la pile vers le bas de celle-ci (en plus de modifier le dessin 
  du croquis &agrave; l'&eacute;cran). Refaire d&eacute;place le pointeur de 
  la pile vers le haut (et bien entendu rajoute le dessin &agrave; le croquis).<br>
</p>
<p>La fonction &quot;continuation&quot; du dessin ne cr&eacute;&eacute;e pas une 
  nouvelle ligne dans la pile d'annulation mais la ligne qui a &eacute;t&eacute; 
  continu&eacute;e est d&eacute;plac&eacute;e sur le dessus de la pile d'annulation. 
  <br>
</p>
<p> Les actions d'effacement et d'&eacute;dition peuvent &eacute;galement &ecirc;tre 
  annul&eacute;es ou refaites. Cependant, leur effet sur la pile n'est pas aussi 
  simple que pour le dessin.<br>
<p> L'effacement est une op&eacute;ration matricielle alors que le dessin est 
  constitu&eacute; d'&eacute;l&eacute;ments vectoriels. Les points des &eacute;l&eacute;ments 
  vectoriels qui se trouvent inclus dans la r&eacute;gion effac&eacute;e sont 
  supprim&eacute;s. Cela affecte la pile d'annulation de deux fa&ccedil;ons. Si 
  un &eacute;l&eacute;ment est compl&egrave;tement effac&eacute; (par exemple, 
  un point), il est supprim&eacute; de la pile. L'annulation de cette action d'effacement 
  replace l'objet, mais en haut de la pile. Effacer le milieu d'une ligne supprime 
  l'objet ligne de la pile et le remplace par deux items qui sont ajout&eacute;s 
  en haut de la pile.</p>
<p><br>
  En cons&eacute;quence, l'effacement d'une ligne peut changer la position de 
  celle-ci dans la pile d'annulation. Effacer le milieu d'une ligne supprime la 
  ligne de la pile et place ses deux extr&eacute;mit&eacute;s en haut de la pile. 
  L' &quot;Annulation&quot; suivante supprimera les deux extr&eacute;mit&eacute;s 
  et restituera la ligne, mais cette fois en haut de la pile. 
</body></html>