<html><body>
<h4><strong>TYPE D'AFFICHAGE (R&Eacute;F&Eacute;RENCES) DU CROQUIS</strong></h4>

<p> La bo&icirc;te de dialogue &quot;<strong>R&eacute;f&eacute;rences du croquis</strong>&quot; 
  est ouverte par le bouton &quot;<strong>R&eacute;f&eacute;rences</strong>&quot;&nbsp;<img src="btn_mode.png" width="36" height="36"> 
  de la <em><a href="manual09.htm">Fen&ecirc;tre de croquis</a></em>.<br>
  Cette bo&icirc;te de dialogue comporte une liste de cases &agrave; cocher permettant 
  de sp&eacute;cifier les &eacute;l&eacute;ments du croquis qui doivent &ecirc;tre 
  affich&eacute;s &agrave; l'&eacute;cran : </p>
<ul>
  <li> <em>Cheminement</em> : affiche la ligne m&eacute;diane reliant les stations 
    du relev&eacute; entre elles (blanche)</li>
  <li> <em>Vis&eacute;es lat&eacute;rales d'habillage</em>: trac&eacute;es en 
    gris</li>
  <li> <em>Derni&egrave;res</em> : vis&eacute;s d&#8217;habillage les plus r&eacute;centes 
    [G]</li>
  <li> <em>Stations</em> : noms &eacute;crits en violet</li>
  <li> <em>Grille</em> : quadrillage en m&egrave;tres ou en yards</li>
  <li> <em>Barre d'&eacute;chelle</em> de r&eacute;f&eacute;rence : affiche une 
    &eacute;chelle sur la grille avec une fl&egrave;che Nord vers le haut</li>
  <li> <em>Contours croquis</em> : superpose le contour d'un autre croquis externe 
  </li>
  <li><em>R&eacute;f&eacute;rences fixes</em> : permet de faire glisser les esquisses 
    ind&eacute;pendamment des vis&eacute;es (<strong>attention</strong> !) </li>
</ul>
<p><strong>Les derni&egrave;res vis&eacute;es d&#8217;habillage</strong>, donc 
  &quot;les plus r&eacute;centes&quot;, peuvent &ecirc;tre mises en &eacute;vidence 
  par une couleur r&eacute;glable (bleu clair par d&eacute;faut) [G]. <br>
  En mode de t&eacute;l&eacute;chargement &agrave; la demande, il s'agit des vis&eacute;es 
  d&#8217;habillage qui ont &eacute;t&eacute; t&eacute;l&eacute;charg&eacute;es 
  le plus r&eacute;cemment. <br>
  En mode continu, il s'agit de toutes les vis&eacute;es d&#8217;habillage t&eacute;l&eacute;charg&eacute;es 
  au cours du dernier intervalle mis en surbrillance.</p>
<p><strong>Il y a trois types grilles :</strong></p>
<p>1. Une grille quadrill&eacute;e &agrave; l'unit&eacute; 1 (gris fonc&eacute;) 
  <br>
  2. Une grille quadrill&eacute;e &agrave; 10 unit&eacute;s (gris) <br>
  3. Une grille quadrill&eacute;e &agrave; 100 unit&eacute;s (gris clair) </p>
<p>Les unit&eacute;s de quadrillage peuvent &ecirc;tre : 1 m, 1 yard, 2 pieds, 
  0.1 m. <br>
  TopoDroid n'affiche que les quadrillages qui sont appropri&eacute;s &agrave; 
  l'&eacute;chelle de zoom du croquis. <br>
</p>
<p> <strong>La barre d'&eacute;chelle</strong> (en bas &agrave; gauche) est proportionnelle 
  aux unit&eacute;s de la grille (m, yard, feet, dm) et elle est surmont&eacute;e 
  d'une petite fl&egrave;che indiquant le Nord magn&eacute;tique vers le haut. 
  <br>
  Si la d&eacute;clinaison du relev&eacute; est d&eacute;finie, le Nord vrai est 
  indiqu&eacute; par une ligne bleu clair, suivant l'angle de d&eacute;clinaison 
  par rapport au Nord magn&eacute;tique. <br>
  Si la d&eacute;clinaison magn&eacute;tique est faible, la ligne bleu nord est 
  tr&egrave;s proche de la fl&egrave;che nord magn&eacute;tique. <br>
  La l&eacute;gende sur la barre d'&eacute;chelle a la m&ecirc;me taille que les 
  noms des stations.</p>
<p><br>
  <strong>Superposer un contour de dessin &agrave; ce croquis</strong></p>
<p>S'il y a d'autres croquis associ&eacute;s &agrave; ce relev&eacute; topo, le 
  contour d'un autre croquis peut &ecirc;tre superpos&eacute; au croquis en cours 
  pour faciliter le dessin (il sera affich&eacute; en gris). <br>
  Cocher cette case ouvre une nouvelle bo&icirc;te de dialogue pour choisir le 
  croquis &agrave; afficher ou pour supprimer l'affichage de ce contour. En l'absence 
  d'autres croquis, cocher cette case ne produit aucun effet. </p>
<p>Le bouton bleu &laquo; Fusionner &raquo; [T] inclut le contour dans le dessin 
  du croquis affich&eacute;. Le bouton EFFACER supprime le contour du croquis.</p>
<p>L'affichage du contour des sections transverses peut &ecirc;tre activ&eacute; 
  ou d&eacute;sactiv&eacute; via la boite de dialogue d'&eacute;dition des points 
  de section.<br>
  L'affichage de ce contour suppl&eacute;mentaire s'efface lorsque est ferm&eacute;e, 
  sauf s&#8217;il a &eacute;t&eacute; fusionn&eacute; au croquis en cours. </p>
<p>&nbsp;</p>
<p> <strong>D&eacute;calage et &eacute;chelle du croquis (R&eacute;f&eacute;rences 
  fixes)</strong></p>
<p>Une autre case &agrave; cocher [E/G] sp&eacute;cifie si la r&eacute;f&eacute;rence 
  d&#8217;affichage doit rester fixe lorsque le dessin est d&eacute;plac&eacute; 
  avec deux doigts (zoom possible mais d&eacute;placement fig&eacute;). <br>
  Cette option est utilis&eacute;e pour ajuster un croquis import&eacute; de <em>PocketTopo</em> 
  ou de <em>Therion</em> &agrave; la r&eacute;f&eacute;rence actuelle dans le 
  cas o&ugrave; elle aurait &eacute;t&eacute; import&eacute;e avec une translation 
  (donc l&eacute;g&egrave;rement d&eacute;cal&eacute;). <br>
  Lorsque vous touchez l'&eacute;cran avec un troisi&egrave;me doigt, le zoom 
  est appliqu&eacute; uniquement au croquis. <br>
</p>
<p> <strong>Vues du fond de dessin (niveaux)</strong></p>
<p> Lorsque les vues du fond sont activ&eacute;es [param&egrave;tres Personnalis&eacute;s], 
  il existe une autre colonne, sur la droite, pour activer et d&eacute;sactiver 
  les vues. Un &eacute;l&eacute;ment de dessin est affich&eacute; s'il appartient 
  &agrave; au moins une vue active.<br>
  La vue de Base (B) est toujours activ&eacute;e. Les autres vues possibles sont 
  les suivantes : <br>
  &#8226; Plancher (F pour Floor)<br>
  &#8226; Remplissage (D pour Decoration)<br>
  &#8226; Plafond (C pour Ceiling)<br>
  &#8226; Art&eacute;facts (A)</p>
<p>Les vues sont d&eacute;sign&eacute;es par une lettre majuscule, B, F, D, C 
  et A, comme indiqu&eacute; ci-dessus. NB : ces appellations mn&eacute;motechniques 
  n'ont aucune signification concr&egrave;te particuli&egrave;re.<br>
</p>
<p> <strong>Contour du croquis</strong></p>
<p>Cette bo&icirc;te de dialogue s'ouvre en cliquant sur le bouton &quot;Contours 
  croquis&quot; dans la bo&icirc;te de dialogue &quot;R&eacute;f&eacute;rences 
  du dessin&quot;.<br>
  Le fait d'appuyer sur une esquisse de la liste affiche son contour dans la maquette 
  de dessin.<br>
  Le bouton &quot;Fusionner&quot; [T] permet d'inclure le contour de l'esquisse 
  affich&eacute;e dans le dessin actuel.<br>
  Le bouton &quot;Effacer&quot; supprime le contour de l'esquisse de la maquette 
  du dessin.<br>
</p>
</body></html>
