<html>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=utf-8" />
</HEAD>
<body>
<h4>MÉMOIRE DU DISTOX </h4>
<p>Cette boîte de dialogue s'ouvre en appuyant sur le bouton <u>Mémoire</u>&nbsp;<img src="btn_memory.png"> 
  de la <em><a href="manual03.htm">Fenêtre des Périphériques</a></em>. </p>
<p> <b>Dump de la mémoire</b> 
<p> Le bouton texte <em>Dump</em> lit le contenu int&eacute;gral de la m&eacute;moire 
  du DistoX. La lecture directe de la m&eacute;moire du DistoX est un processus 
  lent, et le DistoX doit &ecirc;tre maintenu sur &quot;ON&quot; tout en le faisant. 
  Il est conseill&eacute; de ne lire qu'une partie de la m&eacute;moire &agrave; 
  la fois, par exemple 50 mesures. Saisissez l'emplacement du d&eacute;but et 
  de la fin de la sauvegarde m&eacute;moire dans les deux champs de texte &agrave; 
  droite. Si vous avez entr&eacute; un nom de fichier pour ce t&eacute;l&eacute;chargement, 
  il est &eacute;galement enregistr&eacute; dans un fichier de stockage (dans 
  le dossier &quot;<em>dump</em>&quot;). 
<p> L'inspection de la m&eacute;moire n&eacute;cessite une certaine connaissance 
  des composants internes du DistoX : au minimum l'espace d'adressage et la mani&egrave;re 
  dont les donn&eacute;es sont stock&eacute;es. Il est fortement conseill&eacute; 
  d'avoir lu la documentation du DistoX avant de l'utiliser.</p>
<p> Le r&eacute;sultat du téléchargement de la m&eacute;moire est affich&eacute; 
  dans une liste en bas de la bo&icirc;te de dialogue. Chaque ligne contient :</p>
<ul>
  <li>l'emplacement de la m&eacute;moire</li>
  <li>un code-lettre indiquant s'il s'agit d'une vis&eacute;e topo ('d') ou d'une 
    donn&eacute;e d'&eacute;talonnage ('g')</li>
  <li>les valeurs de la m&eacute;moire.</li>
</ul>
<p></p>
<p> Les entr&eacute;es vides sont marqu&eacute;es d'un point d'interrogation ('?').<br>
  Les valeurs de vis&eacute;es topo sont repr&eacute;sent&eacute;es par leur longueur 
  (m&egrave;tres), leur azimut et leur pente (degr&eacute;s).<br>
  Les donn&eacute;es de &quot;pr&eacute;cision&quot; du DistoX2 ne sont pas affich&eacute;es.<br>
  Pour les donn&eacute;es d'&eacute;talonnage, les valeurs sont affich&eacute;es 
  brutes (les donn&eacute;es 'm' ne sont pas affich&eacute;es pour le DistoX2).</p>
<p> <strong>Disponible uniquement pour le DistoX A3</strong> :</p>
<ul>
  <li> <b>Lire</b> les zones de m&eacute;moire</li>
  <li><b>Stocker</b> les zones de m&eacute;moire</li>
  <li><b>R&eacute;initialiser</b> une partie de la m&eacute;moire, c'est-&agrave;-dire 
    les marquer &quot;&agrave; t&eacute;l&eacute;charger&quot;</li>
</ul>
</body></html>