<html>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=utf-8" />
</HEAD>
<body>
<h4>PALETTE D'OUTILS DE DESSIN</h4>
<p>Les outils de dessin inclus dans le programme comprennent 46 points, 16 lignes 
  et 9 zones.</p>
<p> Lorsque l'application d&eacute;marre pour la premi&egrave;re fois, elle installe 
  les fichiers d'outils de dessin dans le r&eacute;pertoire &quot;symbol&quot;. 
  Il y a des fichiers pour les points (symboles spécifiques comme &quot;entr&eacute;e&quot;, 
  ou &quot;stalagmite&quot;), des lignes (comme &quot;paroi&quot;, ou &quot;fosse&quot;), 
  et des zones (r&eacute;gions remplies avec une couleur transparente).</p>
<p> Les éventuelles nouvelles versions des outils de dessin ne sont pas automatiquement 
  install&eacute;es, mais il y a un bouton pour les mettre &agrave; jour. La bo&icirc;te 
  de dialogue &agrave; venir vous indique la version install&eacute;e et la version 
  actuelle et vous demande si vous souhaitez mettre &agrave; jour les outils de 
  dessin.</p>
<p><br>
  Peut-être ne vous seront-ils pas tous utiles ou peut-être que vous en aurez 
  besoin malgré tout. Vous pouvez donc personnaliser les outils de dessin et la 
  fa&ccedil;on dont vous les s&eacute;lectionnez de quatre mani&egrave;res :</p>
<ul>
  <li>avec le choix proposé par la bo&icirc;te de dialogue de l'outil de dessin</li>
  <li>au niveau du croquis</li>
  <li>au niveau du projet topo (r&eacute;pertoire)</li>
  <li>sur le syst&egrave;me de fichiers.</li>
</ul>
<p><b>Boite de dialogue de l'outil de dessin<br>
  </b>La barre inférieure d'outils ne contient que six outils de dessin (pour 
  chaque type). Si vous avez besoin d'un autre outil, vous devez aller dans la 
  <a href="page_tools_list.htm">boîte de dialogue des outils de dessin</a> qui 
  affiche la liste des outils de dessin, divisée en trois onglets : Point, Ligne 
  et Zone.<br>
  Chaque outil affiche le symbole iconique, le nom de l'outil et le groupe d'outils 
  s'il existe. </p>
<p></p>
<p><b>Palette de croquis</b><br>
  Chaque croquis possède sa propre palette. Lorsque vous fermez le croquis, elle 
  est enregistr&eacute;e avec un en-t&ecirc;te listant sa palette. Lorsque vous 
  le rouvrez, cette palette est choisie en tant que palette de croquis. Si le 
  croquis contient des &eacute;l&eacute;ments qui ne sont pas dans la palette, 
  ils sont ajout&eacute;s. Si un &eacute;l&eacute;ment ne figure pas parmi les 
  outils de dessin, il est remplac&eacute; par l'outil &quot;utilisateur&quot;. 
  Les outils &quot;utilisateur&quot; (point, ligne et zone) sont toujours présents 
  dans la palette.</p>
<p> La palette de croquis est sp&eacute;cifi&eacute;e via le menu &quot;<em>PALETTE</em>&quot; 
  de la fen&ecirc;tre de croquis. Cela ouvre une bo&icirc;te de dialogue qui vous 
  permet de d&eacute;cider quel outil activer dans la palette de croquis. Vous 
  activez et d&eacute;sactivez les outils selon vos besoins, puis fermez la bo&icirc;te 
  de dialogue (avec le bouton Pr&eacute;c&eacute;dent) pour enregistrer les modifications. 
  Vous devez le faire ind&eacute;pendamment pour les points, les lignes et les 
  zones.</p>
<p><br>
  <b>Palette globale</b><br>
  &Agrave; l'exception des outils &quot;syst&egrave;me&quot;, TopoDroid charge 
  l'outil de dessin &agrave; partir de fichiers stock&eacute;s dans le sous-r&eacute;pertoire 
  &quot;symbols&quot; de la base &quot;TopoDroid&quot;. Les outils du syst&egrave;me 
  sont les points &quot;utilisateur&quot; et &quot;&eacute;tiquette&quot;, les 
  lignes &quot;utilisateur&quot; et &quot;parois&quot;, les zones &quot;utilisateur&quot; 
  et &quot;eau&quot;. Ceux-ci sont toujours activ&eacute;s.</p>
<p> Le bouton de la palette de la <a href="manual02.htm">fen&ecirc;tre principale</a> 
  d&eacute;finit les fichiers de l'outil de dessin &agrave; charger. Dans la bo&icirc;te 
  de dialogue &agrave; venir, s&eacute;lectionnez les outils charg&eacute;s. La 
  liste des fichiers &agrave; charger est enregistr&eacute;e dans la base de donn&eacute;es 
  du projet. Comme pour la palette au niveau du croquis, vous devez le faire ind&eacute;pendamment 
  pour les points, les lignes et les zones</p>
<p> Lorsque les outils de dessin sont mis &agrave; jour, TopoDroid n'installe 
  pas automatiquement les nouveaux outils. Cependant, aux niveaux d'utilisation 
  sup&eacute;rieurs &agrave; 'Normale', la bo&icirc;te de dialogue d'activation 
  d'outil comporte un bouton pour installer les outils.</p>
<p><br>
  <b>Outils de dessin personnalis&eacute;s</b><br>
  À un niveau encore plus &eacute;lev&eacute;, &agrave; savoir celui du r&eacute;pertoire 
  de base &quot;TopoDroid&quot;, vous pouvez personnaliser les fichiers d'outils. 
  Vous pouvez les modifier, supprimer ceux dont vous n'avez pas besoin et en ajouter 
  de nouveaux (pour les outils non inclus dans le programme). M&ecirc;me si TopoDroid 
  est livr&eacute; avec de nombreux outils de dessin pr&eacute;install&eacute;s, 
  il peut arriver qu'il ne contienne pas les outils dont vous avez besoin (ou 
  alors que vous n'aimiez pas celui fourni). Les fichiers d'outils sont des fichiers 
  texte, et vous pouvez &eacute;crire votre propre fichier d'outil(s). Apr&egrave;s 
  les avoir plac&eacute;s dans les sous-r&eacute;pertoires de symboles, TopoDroid 
  les lira et les utilisera. La syntaxe des fichiers d'outils est d&eacute;crite 
  dans une page du site Web speleoapps.</p>
<p><br>
  Les outils de dessin &quot;syst&egrave;me&quot; ne peuvent &ecirc;tre ni modifi&eacute;s, 
  ni supprim&eacute;s.</p>
<h4>&nbsp; </h4>

</body></html>