<html>
<body>

<h4>&Eacute;TALONNAGE DU BRIC4</h4>

L'&eacute;talonnage du BRIC4 est effectu&eacute; en interne.<br>
Il existe deux proc&eacute;dures d&#8217;&eacute;talonnage pour le compas : un 
&eacute;talonnage complet et un &eacute;talonnage rapide qui met &agrave; jour 
la correction des valeurs du capteur magn&eacute;tique.<br>
<p> <strong>&Eacute;talonnage complet</strong><br>
  <br>
  L'&eacute;talonnage complet n&eacute;cessite l'acquisition de quatre donn&eacute;es 
  &agrave; diff&eacute;rents roulis (rotations axiales) dans plusieurs directions 
  (au moins 14), couvrant toutes les orientations possibles. 
<p> Allez dans &quot;<em>Menu, Calibration, CAL : Full INC&amp;AZM</em>&quot;. 
  Un message avec des instructions appara&icirc;t. Appuyez sur n'importe quel 
  bouton pour continuer. L'&eacute;cran affiche l'&eacute;tat et la distribution 
  des groupes pendant l'ex&eacute;cution de l'&eacute;talonnage. Prenez quatre 
  photos pour chaque point en tournant l'appareil d'environ 90 degr&eacute;s autour 
  de la direction du laser. Quatre points indiquent le nombre de photos prises 
  pour le groupe. Les marques dans deux barres horizontales montrent o&ugrave; 
  la distribution des groupes compl&eacute;t&eacute;s valeurs magn&eacute;tiques 
  et acc&eacute;l&eacute;rom&eacute;triques. Les curseurs situ&eacute;s sous les 
  barres indiquent la position du groupe qui est en train d'&ecirc;tre pris. 
<p> &#8226; L'appareil d&eacute;tecte automatiquement le d&eacute;but d'un nouveau 
  groupe.<br>
  &#8226; Si moins de quatre photos sont prises, le groupe n'est pas sauvegard&eacute;.<br>
  &#8226; Si plus de quatre donn&eacute;es sont prises, seules les quatre derni&egrave;res 
  sont utilis&eacute;es.<br>
  &#8226; Il est possible de r&eacute;initialiser le groupe en cours et de le 
  red&eacute;marrer. 
<p>Lorsque 14 groupes ont &eacute;t&eacute; pris, la touche &quot;Done&quot; appara&icirc;t. 
  Une pression sur cette touche lance le calcul de l'&eacute;talonnage. <br>
  Apr&egrave;s le calcul de l'&eacute;talonnage, un rapport s'affiche. </p>
<p> <b>Quick azimuth calibration</b><br>
  <br>
  Go to <i>Menu</i>, <i>Calibration</i>, <i>CAL: Quick AZM</i>.<br>
  A message with instructions appears. Press any button to continue.<br>
  A grid with a cross-hair is displayed.<br>
  The device must take samples of the sensor values that cover all directions.<br>
  Turn the device slowly around in every direction. When the device need to take 
  a sample the backlight turns off and sampling for that point begins. When the 
  sample is taken there is a beep.<br>
  When the grid is full the calibration computation begins and a report is displayed.
<p><strong>&Eacute;talonnage rapide de l'azimut</strong>
<p> Voir &quot;<em>Menu, Etalonnage, CAL : AZM rapide</em>&quot;. <br>
  Un message contenant des instructions s'affiche. Appuyez sur n'importe quel 
  bouton pour continuer. <br>
  Une grille avec un r&eacute;ticule s'affiche. <br>
  L'appareil doit prendre des &eacute;chantillons des valeurs du capteur qui couvrent 
  toutes les directions. <br>
  Tournez lentement l'appareil dans toutes les directions. Lorsque l'appareil 
  doit pr&eacute;lever un &eacute;chantillon, le r&eacute;tro&eacute;clairage 
  s'&eacute;teint et l'&eacute;chantillonnage pour ce point commence. Un bip sonore 
  retentit lorsque l'&eacute;chantillon est pr&eacute;lev&eacute;. <br>
  Lorsque la grille est pleine, le calcul de l'&eacute;talonnage commence et un 
  rapport s'affiche. </p>
<p>NB : L'&eacute;talonnage peut &ecirc;tre interrompu &agrave; tout moment en 
  appuyant sur &quot;<em>Abort</em>&quot;. </p>
<p> <strong>&Eacute;talonnage de la distance</strong>
<p> Aller &agrave; &quot;<em>Menu, Etalonnage, CAL</em>&quot; : <br>
  Un message contenant des instructions s'affiche. Appuyez sur n'importe quel 
  bouton pour continuer.<br>
  Placez une cible &agrave; une distance sp&eacute;cifi&eacute;e de 1 m, ou 3 
  ft, d'un point de station. La distance doit &ecirc;tre mesur&eacute;e &agrave; 
  l'aide d'un instrument pr&eacute;cis. <br>
  Effectuez quatre tirs et assurez-vous que leurs valeurs sont &eacute;gales.<br>
  Appuyez sur &quot;<em>Done</em>&quot;. Un rapport d'&eacute;talonnage s'affiche. 
</p>
<p><br>
</p>
<p><br>
</body>
</html>
