<html><body>
<h4>FEN&Ecirc;TRE DE CROQUIS</h4>

<strong>Pr&eacute;sentation g&eacute;n&eacute;rale </strong> 
<p>La bo&icirc;te de dialogue &quot;croquis&quot; permet de cr&eacute;er un nouveau 
  croquis ou d'ouvrir un croquis existant. Il y a un bouton pour cr&eacute;er 
  un nouveau croquis, et une liste &agrave; deux colonnes des croquis du relev&eacute; 
  actuel. Les &eacute;l&eacute;ments de la colonne de gauche ouvrent un croquis 
  en plan, ceux de la colonne de droite l'ouvrent en coupe. </p>
<p> Le bouton &quot;croquis du relev&eacute; topo&quot; de la fen&ecirc;tre des 
  donn&eacute;es du relev&eacute; topographique ouvre la bo&icirc;te de dialogue 
  avec la liste des croquis d&eacute;j&agrave; pr&eacute;sents ainsi qu'un bouton 
  &quot;Nouveau croquis&quot;. Appuyez sur ce bouton pour cr&eacute;er un nouveau 
  croquis pour ce relev&eacute;.</p>
<p>Chaque nouveau croquis est compos&eacute;e de deux fichiers de croquis : un 
  dessin pour la vue en plan, un autre dessin pour la vue en coupe (au choix : 
  d&eacute;velopp&eacute;e ou projet&eacute;e). La nouvelle esquisse s'ouvrira 
  d'abord sur la vue en plan.<br>
  Le cas &eacute;ch&eacute;ant la liste des croquis d&eacute;j&agrave; existants 
  comporte deux colonnes :</p>
<ul>
  <li> les vues en plan &agrave; gauche</li>
  <li> les vues en coupe (&eacute;tendue ou projet&eacute;e) sur la droite.</li>
</ul>
<p> Chaque esquisse se compose d'un croquis de vue en plan et d'un croquis de 
  vue en coupe qui sont class&eacute;s en deux colonnes. <br>
  Tapez sur une entr&eacute;e de croquis pour l'ouvrir. Si vous touchez l'entr&eacute;e 
  de gauche, le croquis s'ouvre sur une vue en plan. Si vous touchez l'entr&eacute;e 
  de droite, le croquis s'ouvre sur une vue en coupe.<br>
  Les vis&eacute;es lat&eacute;rales d&#8217;habillage (rayonnement) sont compos&eacute;es 
  d'un seul fichier de dessin. </p>
<p> La vue en coupe d&eacute;velopp&eacute;e affiche la ligne m&eacute;diane (polygonale) 
  avec les vis&eacute;es orient&eacute;es vers la gauche, vers la droite, ou &agrave; 
  la verticale, en fonction de leur &laquo;extension&raquo;. Le cheminement est 
  projet&eacute; sur le plan vertical de la vis&eacute;e la plus proche en azimut, 
  &agrave; moins que l'utilisateur n'ait impos&eacute; une &quot;extension&quot; 
  dans la bo&icirc;te de dialogue d'&eacute;dition des vis&eacute;es. Par exemple, 
  pour la vue en plan de la figure ci-dessous, les vis&eacute;es dans la r&eacute;gion 
  claire sont projet&eacute;es sur le plan vertical de la vis&eacute;e 1-2, celles 
  dans la r&eacute;gion sombre sur le plan vertical de 0-1.</p>
<p>La coupe projet&eacute;e affiche la ligne m&eacute;diane et les vis&eacute;es 
  lat&eacute;rales projet&eacute;es dans le plan vertical perpendiculaire &agrave; 
  l'azimut de la projection.<br>
  <br>
</p>
</body></html>
