	<html>
	<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=utf-8" />
</HEAD>
	<body>
<h4> TÉLÉCHARGEMENT DES DONNEES DU PÉRIPHÉRIQUE LASER</h4>
<p align="justify">Le bouton <em>T&eacute;l&eacute;charger</em> <img src="btn_telecharger.png"> 
  d&eacute;marre une connexion avec l'appareil&nbsp; périphérique (par exemple 
  un DistoX) pour t&eacute;l&eacute;charger les donn&eacute;es. Tant que la connexion 
  est active, il reste rouge. Si vous utilisez le mode de t&eacute;l&eacute;chargement 
  &quot;<em>&agrave; la demande</em>&quot;, la connexion est ferm&eacute;e lorsqu'il 
  n'y a plus de donn&eacute;es &agrave; r&eacute;cup&eacute;rer. Avec le mode 
  de t&eacute;l&eacute;chargement &quot;<em>continu</em>&quot;, la connexion reste 
  ouverte (et les donn&eacute;es sont t&eacute;l&eacute;charg&eacute;es en continu 
  d&egrave;s que les mesures sont prises) jusqu'&agrave; ce que le DistoX et l'Android 
  perdent la connexion Bluetooth. Le mode qui vous convient le mieux d&eacute;pend 
  de vos habitudes. Avec le mode &quot;<em>&agrave; la demande</em>&quot;, vous 
  pouvez vous concentrer sur le croquis et d'autres t&acirc;ches sans &ecirc;tre 
  g&ecirc;n&eacute; par les donn&eacute;es entrantes, et lorsque vous t&eacute;l&eacute;chargez 
  les donn&eacute;es, vous pouvez vous concentrer sur elles (elles sont surlign&eacute;es 
  en bleu). D'autre part, le t&eacute;l&eacute;chargement &quot;<em>&agrave; la 
  demande</em>&quot; n&eacute;cessite des pauses pour obtenir les donn&eacute;es, 
  et celles-ci sont particuli&egrave;rement longues si vous avez pris plusieurs 
  vis&eacute;es entre les deux.</p>
<p align="justify"> Si la connexion Bluetooth avec l'appareil est interrompue 
  (par exemple si l'appareil de mesure s'&eacute;loigne trop de l'appareil Android 
  ou s'il est &eacute;teint), le t&eacute;l&eacute;chargement des donn&eacute;es 
  est interrompu. En mode &quot;<em>continu</em>&quot;, si le param&egrave;tre 
  &quot;<em>Reconnexion automatique</em>&quot; est s&eacute;lectionn&eacute;, 
  TopoDroid essaie de se connecter au DistoX toutes les quelques secondes.</p>
<p align="justify">Lorsque l'activit&eacute; de prise de donn&eacute;es (vis&eacute;es) 
  est ferm&eacute;e <u>(fenêtre de données</u> fermée), la connexion de t&eacute;l&eacute;chargement 
  des donn&eacute;es est interrompue. La connexion de t&eacute;l&eacute;chargement 
  n'est pas interrompue lorsque l'activit&eacute; est en pause (l'affichage s'&eacute;teint). 
  Si vous ouvrez un croquis alors que la connexion de t&eacute;l&eacute;chargement 
  est active en mode &quot;<em>continu</em>&quot;, la connexion est conserv&eacute;e 
  et les donn&eacute;es sont t&eacute;l&eacute;charg&eacute;es (et affich&eacute;es 
  dans le croquis au fur et &agrave; mesure).</p>
Pour le <em>Sap5</em> et le <em>Bric4</em>, les données sont toujours téléchargées 
en mode <em>continu</em>. 
<p align="justify"> <strong>Bric4</strong><br>
  <br>
  Le téléchargement des données du Bric4 peut être limité aux valeurs essentielles 
  (distance, azimut, pente, et un peu plus), ou complet, avec toutes les informations 
  transférées par le protocole Bric4.<br>
  Le protocole complet inclut l'&quot;index&quot; de la visée. Par défaut, TopoDroid 
  utilise l'index Bric4 comme index des données dans la table de la base de données, 
  s'il le reçoit. Comme l'index des données doit être unique, si TopoDroid reçoit 
  une visée avec un index qui est déjà dans la base de données, une nouvelle valeur 
  est utilisée à la place de l'index Bric4.</p>
<p> L'indice Bric4 peut être réinitialisé à l'aide du menu <em>Advanced</em> | 
  <em>Memory clear</em> BRIC4 command.</p>
<h4>&nbsp; </h4>
</body></html>