<html><body>
<h4>PERMISSIONS Android</h4>

<p><strong>Stockage</strong><br>
  TopoDroid enregistre les donn&eacute;es de relev&eacute; et les croquis, ainsi 
  que les &eacute;talonnages, dans le stockage externe.<br>
  Il ne peut pas fonctionner sans acc&egrave;s en lecture/&eacute;criture au stockage. 
  <br>
</p>
<p><strong>Internet</strong><br>
  La connexion r&eacute;seau est n&eacute;cessaire uniquement si vous souhaitez 
  installer une traduction du manuel d'utilisation.<br>
  TopoDroid n'utilise pas le r&eacute;seau d'une autre mani&egrave;re, et il est 
  prudent de d&eacute;sactiver cette autorisation. </p>
<p><br>
  <strong>Bluetooth</strong><br>
  TopoDroid n&eacute;cessite un acc&egrave;s Bluetooth pour communiquer avec les 
  appareils de mesure.<br>
  Si les donn&eacute;es du relev&eacute; sont saisies manuellement, il peut &ecirc;tre 
  utilis&eacute; sans Bluetooth.<br>
  TopoDroid utilise &eacute;galement l'appairage Bluetooth pour s'associer aux 
  appareils nouvellement d&eacute;couverts. La d&eacute;couverte et l'appairage 
  peuvent &ecirc;tre effectu&eacute;s avec l'application &quot;param&egrave;tres&quot;. 
</p>
<p><br>
  <strong>Appareil photo</strong><br>
  TopoDroid peut utiliser l'appareil photo pour prendre des photos.<br>
  La gestion de l'appareil photo de TopoDroid n'est pas aussi riche en fonctionnalit&eacute;s 
  que celle d'une application &quot;appareil photo&quot;, mais elle enregistre 
  la direction de la vue (azimut et inclinaison) dans les photos.<br>
  Il devrait &ecirc;tre possible d'utiliser TopoDroid sans cette autorisation. 
</p>
<p><br>
  <strong>Audio</strong><br>
  TopoDroid utilise le microphone pour enregistrer des notes audio (pour les vis&eacute;es 
  et les points audio).<br>
  Si cette autorisation n'est pas accord&eacute;e, l'enregistrement audio est 
  d&eacute;sactiv&eacute;.<br>
  Vous pouvez utiliser TopoDroid en toute s&eacute;curit&eacute; sans cette autorisation. 
</p>
<p><br>
  <strong>Localisation</strong><br>
  TopoDroid utilise le GPS du p&eacute;riph&eacute;rique pour obtenir la position 
  g&eacute;ographique d'un point, mais il peut l'importer depuis l'appli <em>MobileTopographer</em>.<br>
  Vous pouvez utiliser TopoDroid en toute s&eacute;curit&eacute; sans cette autorisation. 
</p>
<p> 
</body></html>