<html><body>
<h4><strong>SAP5 GUIDE DE R&Eacute;F&Eacute;RENCE</strong></h4> 
Le SAP5, Shetland Attack Pony, est muni d'un seul bouton. <br>
  On l'allume et on l'&eacute;teint en tapant rapidement deux fois de suite sur 
  le bouton.
<p> Le SAP5 doit &ecirc;tre coupl&eacute; avec Android avant de pouvoir &ecirc;tre 
  utilis&eacute; dans <em>TopoDroid</em>. Ouvrez l'application Param&egrave;tres 
  de votre Android, et allez dans &quot;Appareils connect&eacute;s&quot;. Si le 
  SAP5 n'est pas list&eacute;, allumez-le et s&eacute;lectionnez &quot;Appairer 
  un nouvel appareil&quot;. Le SAP5 devrait appara&icirc;tre dans la liste des 
  appareils disponibles. Tapez dessus et entrez le code PIN &quot;000000&quot;, 
  six z&eacute;ros. 
<p> Lorsque le SAP5 est allum&eacute;, le laser s'allume. Pour faire une mesure, 
  pointez la cible et maintenez le bouton enfonc&eacute; jusqu'&agrave; ce que 
  la lumi&egrave;re du laser flashe ou s'&eacute;teigne. Les mesures s'affichent 
  &agrave; l'&eacute;cran, soit une &agrave; la fois (azimut, pente, distance 
  et extension du plan), soit les trois &agrave; la fois. Vous pouvez passer d'un 
  affichage &agrave; l'autre en inclinant l'appareil vers l'arri&egrave;re et 
  vers l'avant. Si vous appuyez sur le bouton lorsqu'une valeur est affich&eacute;e, 
  le laser s'allume et l'appareil est pr&ecirc;t &agrave; effectuer la vis&eacute;e 
  suivante.
<p> Apr&egrave;s l'affichage des valeurs, l'&eacute;cran affiche les menus :
<ul>
  <li><em>Store</em>, pour assigner des stations &agrave; la vis&eacute;e et la 
    sauvegarder dans la m&eacute;moire interne.</li>
  <li><em>Discard</em>, pour revenir en arri&egrave;re et prendre une autre mesure</li>
  <li><em>Main menu</em>, avec 
    <ul>
      <li><em>Settings</em> : permet le param&eacute;trage de l'appareil </li>
      <li><em>Measure</em> : revient en arri&egrave;re pour prendre une mesure 
      </li>
      <li> <em>Calibrate</em> : entre dans la proc&eacute;dure d&#8217;&eacute;talonnage 
        de l'appareil </li>
      <li><em>Visualize</em> : visualise un plan approximatif de la topographie</li>
      <li><i>Info</i> affiche (entre autres) des informations sur la vis&eacute;e, 
        la temp&eacute;rature de l'appareil, la charge de la batterie et les relev&eacute;s 
        des capteurs en temps r&eacute;el </li>
      <li><i>Off</i> : &eacute;teint le SAP5</li>
    </ul>
  </li>
</ul>
<p>Le niveau de la batterie est affich&eacute; &agrave; l'&eacute;cran. Le SAP5 
  est &eacute;quip&eacute; d'une prise micro USB &agrave; l'arri&egrave;re. Lorsqu'il 
  est connect&eacute; au PC il se recharge et les donn&eacute;es peuvent &ecirc;tre 
  t&eacute;l&eacute;charg&eacute;es &agrave; l'aide du programme &quot;PonyTrainer&quot;.
<p>Lorsqu'il est connect&eacute; &agrave; <em>TopoDroid</em>, chaque vis&eacute;e 
  est automatiquement transf&eacute;r&eacute;e dans l'application d&egrave;s qu'elle 
  est effectu&eacute;e. Si la connexion est interrompue, les mesures prises hors 
  connexion ne sont pas transf&eacute;r&eacute;es lorsque la connexion est r&eacute;tablie. 
  Par cons&eacute;quent, le SAP5 convient aux relev&eacute;s topographiques pour 
  lesquels il peut toujours rester en connexion avec Android.
<p>Reportez-vous &agrave; la documentation du SAP5 pour plus de d&eacute;tails 
  sur l'appareil. 
<p>

</body></html>
