<html>
<body>

<h4>AJUSTEMENT DU ZOOM DU CROQUIS</h4>

Cette bo&icirc;te de dialogue s'ouvre par le menu &quot;ZOOM&quot;.<br>
<br>
Dans cette bo&icirc;te de dialogue, vous pouvez : 
<ul>
  <li>Choisir l'orientation de la pr&eacute;sentation et adapter le croquis &agrave; 
    l'&eacute;cran</li>
  <li>D&eacute;finir une grille de papier millim&eacute;tr&eacute; ou une grille 
    m&eacute;trique</li>
  <li>Centrer le croquis sur une station donn&eacute;e</li>
</ul>
<p><br>
  <strong>Orientation</strong><br>
  Cette orientation fait r&eacute;f&eacute;rence &agrave; la pr&eacute;sentation 
  du croquis par TopoDroid et n'est pas li&eacute;e &agrave; l'orientation Portrait/Paysage 
  g&eacute;r&eacute;e par Android.</p>
<p><br>
  L'orientation s'applique uniquement aux vues plan/coupe. Vous pouvez choisir 
  d'afficher le croquis avec la direction du nord vers le haut de l'&eacute;cran 
  ou vers la gauche.</p>
<p><br>
  <strong>Papier millim&eacute;tr&eacute;</strong><br>
  Au lieu de la grille m&eacute;trique, avec des cellules correspondant aux unit&eacute;s 
  de grille s&eacute;lectionn&eacute;es, il est possible d'avoir une grille en 
  papier millim&eacute;tr&eacute; avec des cellules de 1 mm, comme pour le dessin 
  technique. Avec le papier millim&eacute;tr&eacute;, l'unit&eacute; du croquis 
  est de 1 m.<br>
  L'&eacute;chelle du croquis doit &ecirc;tre choisie parmi 1:100, 1:200, 1:300, 
  1:400 et 1:500. Choisissez &quot;---&quot; pour revenir &agrave; la grille m&eacute;trique. 
  Appuyez sur le bouton &quot;Papier millim&eacute;tr&eacute;&quot; pour confirmer 
  le choix. <br>
  La taille du papier millim&eacute;tr&eacute; affich&eacute; est approximative 
  car il n'est pas possible d'obtenir une valeur pr&eacute;cise pour tous les 
  appareils Android. Le param&egrave;tre personnalis&eacute; (Geek) &quot;&eacute;chelle 
  du papier millim&eacute;tr&eacute;&quot; permet de calibrer le papier millim&eacute;tr&eacute; 
  en ajustant un segment de 5 cm de long (utiliser une vraie r&egrave;gle gradu&eacute;e). 
</p>
<p><br>
  <strong>Centrer le croquis sur une station</strong><br>
  Entrez la station centrale et appuyez sur le bouton &quot;Centrer sur&quot; 
  pour confirmer. <br>
</p>
<p> Fermez la bo&icirc;te de dialogue &agrave; l'aide du bouton <em>Annuler</em> 
  pour abandonner toute action.<br>

<p>

</body>
</html>
